{
  "title": "Top AI/LLM learning resource in 2025",
  "text": "\n\nThe Blog is organized into three main segments:\n\n\n\n- LLM Fundamentals(optional) – Covers essential topics such as mathematics, Python, and neural networks.\n\n- The LLM Scientist– Concentrates on creating the best-performing LLMs using state-of-the-art techniques.\n\n- The LLM Engineer– Focuses on building applications based on LLMs and deploying them.\n\n\n\n\n\n### 📝 Notebooks\n\n\n\nBelow is a collection of notebooks and articles dedicated to LLMs.\n\n\n\n### Tools\n\n\n\n\n\n### Fine-tuning\n\n\n\n\n\n### Quantization\n\n\n\n\n\n### Other\n\n\n\n\n\n\n\n### LLM Fundamentals\n\n\n\nThis section provides core knowledge about mathematics, Python, and neural networks. While you may not begin here if you already have the basics, feel free to refer back as needed.\n\n\n\n### 1. Mathematics for Machine Learning\n\n\n\nBefore diving deep into machine learning, it is essential to master the fundamental mathematical concepts that underpin these algorithms:\n\n\n\n- Linear Algebra: Crucial for many algorithms, particularly in deep learning. Topics include vectors, matrices, determinants, eigenvalues and eigenvectors, vector spaces, and linear transformations.\n\n- Calculus: Needed to optimize continuous functions. Learn about derivatives, integrals, limits, series, multivariable calculus, and gradient concepts.\n\n- Probability and Statistics: Key for understanding model behavior and data prediction. Essential topics include probability theory, random variables, distributions, expectations, variance, covariance, correlation, hypothesis testing, confidence intervals, maximum likelihood estimation, and Bayesian inference.\n\n\n\nResources:\n\n\n\n- 3Blue1Brown – The Essence of Linear Algebra\n\n- StatQuest with Josh Starmer – Statistics Fundamentals\n\n- AP Statistics Intuition by Ms Aerin\n\n- Immersive Linear Algebra\n\n- Khan Academy – Linear Algebra\n\n- Khan Academy – Calculus\n\n- Khan Academy – Probability and Statistics\n\n\n\n\n\n### 2. Python for Machine Learning\n\n\n\nPython is a flexible and powerful language, especially suited for machine learning because of its clear syntax and extensive ecosystem.\n\n\n\n- Python Basics: Understand basic syntax, data types, error handling, and object-oriented programming.\n\n- Data Science Libraries: Gain experience with NumPy for numerical operations; Pandas for data manipulation; and Matplotlib/Seaborn for visualizations.\n\n- Data Preprocessing: Learn techniques such as feature scaling, normalization, handling missing values, outlier detection, encoding categorical data, and data splitting.\n\n- Machine Learning Libraries: Familiarize yourself with Scikit-learn, which offers numerous supervised and unsupervised algorithms. Understand implementations of linear regression, logistic regression, decision trees, random forests, k-nearest neighbors, K-means clustering, and dimensionality reduction methods like PCA and t-SNE.\n\n\n\nResources:\n\n\n\n- Real Python\n\n- freeCodeCamp – Learn Python\n\n- Python Data Science Handbook\n\n- freeCodeCamp – Machine Learning for Everybody\n\n- Udacity – Intro to Machine Learning\n\n\n\n\n\n### 3. Neural Networks\n\n\n\nNeural networks form the backbone of many modern deep learning models. It’s important to understand how they work and are built:\n\n\n\n- Fundamentals: Know the basic structure including layers, weights, biases, and activation functions (sigmoid, tanh, ReLU, etc.).\n\n- Training and Optimization: Get to know backpropagation, common loss functions (MSE, Cross-Entropy), and optimization algorithms (Gradient Descent, SGD, RMSprop, Adam).\n\n- Overfitting: Understand what overfitting means and study regularization techniques such as dropout, L1/L2 regularization, early stopping, and data augmentation.\n\n- Implementing a Multilayer Perceptron (MLP): Build an MLP (a fully connected network) using frameworks like PyTorch.\n\n\n\nResources:\n\n\n\n- 3Blue1Brown – But what is a Neural Network?\n\n- freeCodeCamp – Deep Learning Crash Course\n\n- Fast.ai – Practical Deep Learning\n\n- Patrick Loeber – PyTorch Tutorials\n\n\n\n\n\n### 4. Natural Language Processing (NLP)\n\n\n\nNLP is an exciting field that connects human language with machine comprehension. It ranges from basic text processing to capturing intricate linguistic nuances.\n\n\n\n- Text Preprocessing: Understand tokenization (dividing text into words or sentences), stemming (reducing words to their roots), lemmatization (context-aware reduction), and stop word removal.\n\n- Feature Extraction Techniques: Learn how to transform textual data for machine learning algorithms using techniques like Bag-of-Words (BoW), TF-IDF, and n-grams.\n\n- Word Embeddings: Study methods such as Word2Vec, GloVe, and FastText which allow words with similar meanings to have similar vector representations.\n\n- Recurrent Neural Networks (RNNs): Learn how RNNs are designed for sequential data and explore variants like LSTMs and GRUs, which capture long-term dependencies.\n\n\n\nResources:\n\n\n\n- Lena Voita – Word Embeddings\n\n- RealPython – NLP with spaCy in Python\n\n- Kaggle – NLP Guide\n\n- Jay Alammar – The Illustration Word2Vec\n\n- Jake Tae – PyTorch RNN from Scratch\n\n- colah’s blog – Understanding LSTM Networks\n\n\n\n\n\n### The LLM Scientist\n\n\n\nThis section is designed to help you learn how to build the most effective LLMs using the latest methodologies.\n\n\n\n### 1. The LLM Architecture\n\n\n\nYou don’t need an exhaustive understanding of the Transformer architecture, but it is important to know the major steps in modern LLMs: converting text into numeric tokens, processing these tokens with layers (including attention mechanisms), and using various sampling strategies to generate text.\n\n\n\n- Architectural Overview: Trace the evolution from encoder-decoder Transformers to decoder-only structures like GPT, which are fundamental to modern LLMs. Understand how these models process and generate text at a high level.\n\n- Tokenization: Learn the principles behind tokenization and how it transforms text into numerical data that models can process. Investigate different tokenization strategies and their effects on performance and output quality.\n\n- Attention Mechanisms: Master the concept of attention, particularly self-attention and its variants, and see how they help models deal with long-range dependencies and maintain contextual integrity.\n\n- Sampling Techniques: Compare deterministic methods (e.g., greedy search, beam search) to probabilistic methods (e.g., temperature sampling, nucleus sampling) and evaluate the trade-offs involved.\n\n\n\nReferences:\n\n\n\n- Visual intro to Transformersby 3Blue1Brown\n\n- LLM Visualizationby Brendan Bycroft\n\n- nanoGPTby Andrej Karpathy (includes a tokenization video:here)\n\n- Attention? Attention!by Lilian Weng\n\n- Decoding Strategies in LLMsby Maxime Labonne\n\n\n\n\n\n### 2. Pre-training Models\n\n\n\nPre-training LLMs is an expensive and resource-intensive process. Although this course does not primarily focus on pre-training, understanding the process, particularly regarding data handling and model parameters, is crucial. For smaller-scale hobbyist projects, pre-training on models with fewer than 1B parameters is feasible.\n\n\n\n- Data Preparation: Pre-training requires vast datasets (for example,Llama 3.1was trained on 15 trillion tokens), which must be curated, cleaned, deduplicated, and tokenized. Modern pipelines include extensive quality filtering.\n\n- Distributed Training: Explore techniques such as data parallelism (distributing batches), pipeline parallelism (distributing layers), and tensor parallelism (splitting operations). These require effective network communication and memory management across GPU clusters.\n\n- Training Optimization: Utilize adaptive learning rate schedules with warm-up, gradient clipping and normalization, mixed-precision training, and modern optimizers (AdamW, Lion) with well-tuned hyperparameters.\n\n- Monitoring: Implement dashboards and logging to track metrics (loss, gradients, GPU usage) and profile performance to identify computational and communication bottlenecks.\n\n\n\nReferences:\n\n\n\n- FineWebby Penedo et al.\n\n- RedPajama v2by Weber et al.\n\n- nanotronby Hugging Face (used forSmolLM2)\n\n- Parallel Trainingby Chenyan Xiong\n\n- Distributed Trainingby Duan et al.\n\n- OLMo 2by AI2\n\n- LLM360by LLM360\n\n\n\n\n\n### 3. Post-training Datasets\n\n\n\nPost-training datasets are organized with clear structures including instructions paired with answers (supervised fine-tuning) or instructions paired with chosen/rejected responses (preference alignment). Given that conversational datasets are less common compared to raw pre-training data, additional processing is often needed to enhance sample accuracy, diversity, and complexity. More details can be found in the💾 LLM Datasetsrepository.\n\n\n\n- Storage & Chat Templates: Due to their conversational nature, these datasets are stored in formats such as ShareGPT or OpenAI/HF. These are then mapped to chat templates like ChatML or Alpaca for training.\n\n- Synthetic Data Generation: Use frontier models like GPT-4o to create instruction-response pairs from seed data. This method offers flexibility and scalability, with considerations for diverse seed tasks and effective system prompts.\n\n- Data Enhancement: Enhance your samples with techniques including verified outputs (using unit tests/solvers), generating multiple answers with rejection sampling,Auto-Evol, Chain-of-Thought, Branch-Solve-Merge, persona-based approaches, and more.\n\n- Quality Filtering: Traditional filtering methods involve rule-based approaches, duplicate removal (using MinHash or embeddings), and n-gram decontamination, with reward models and judge LLMs providing additional quality control.\n\n\n\nReferences:\n\n\n\n- Synthetic Data Generatorby Argilla\n\n- LLM Datasetsby Maxime Labonne\n\n- NeMo-Curatorby Nvidia\n\n- Distilabelby Argilla\n\n- Semhashby MinishLab\n\n- Chat Templateby Hugging Face\n\n\n\n\n\n### 4. Supervised Fine-Tuning\n\n\n\nSupervised Fine-Tuning (SFT) transforms base models into helpful assistants capable of following instructions and structuring answers effectively. Although SFT can be used to introduce new knowledge, its ability to completely learn a new language is limited. Thus, prioritizing data quality over parameter tuning is essential.\n\n\n\n- Training Techniques: Full fine-tuning updates all parameters but requires significant computational resources. Techniques like LoRA and QLoRA update only a small number of adapter parameters while keeping the base model frozen. QLoRA further combines 4-bit quantization with LoRA to minimize VRAM usage.\n\n- Training Parameters: Important parameters to manage include the learning rate (with schedulers), batch size, gradient accumulation, number of epochs, optimizers (e.g., 8-bit AdamW), weight decay, warmup steps, and specific LoRA parameters (rank, alpha, target modules).\n\n- Distributed Training: Utilize multiple GPUs via frameworks such as DeepSpeed or FSDP. DeepSpeed offers ZeRO optimization stages to improve memory efficiency by partitioning state information. Both frameworks support gradient checkpointing.\n\n- Monitoring: Keep an eye on metrics like loss curves, learning rate changes, and gradient norms, while addressing issues such as loss spikes or gradient explosions.\n\n\n\nReferences:\n\n\n\n- Fine-tune Llama 3.1 Ultra-Efficiently with Unslothby Maxime Labonne\n\n- Axolotl – Documentationby Wing Lian\n\n- Mastering LLMsby Hamel Husain\n\n- LoRA insightsby Sebastian Raschka\n\n\n\n\n\n### 5. Preference Alignment\n\n\n\nPreference alignment is a secondary stage in the post-training process that helps fine-tune the model’s tone and reduce issues like toxicity and hallucinations. Its purpose is to improve performance and usefulness, and it generally involves methods like Direct Preference Optimization (DPO) and Proximal Policy Optimization (PPO).\n\n\n\n- Rejection Sampling: For each prompt, generate multiple responses from the model, then score them to create on-policy data consisting of both chosen and rejected answers.\n\n- Direct Preference Optimization: This method optimizes the policy by directly increasing the likelihood of chosen responses over rejected ones, without needing a separate reward model. Although it is more computationally efficient than PPO, it may offer a slight decrease in quality.\n\n- Proximal Policy Optimization: This method iteratively updates the policy to maximize rewards while keeping changes close to the original behavior, using a reward model to score responses and requiring careful hyperparameter tuning (learning rate, batch size, and PPO clip range).\n\n- Monitoring: Alongside SFT metrics, monitor the margin between chosen and rejected responses and track overall accuracy improvements until reaching a plateau.\n\n\n\nReferences:\n\n\n\n- Illustrating RLHFby Hugging Face\n\n- LLM Training: RLHF and Its Alternativesby Sebastian Raschka\n\n- Preference Tuning LLMsby Hugging Face\n\n- Fine-tune Mistral-7b with DPOby Maxime Labonne\n\n- DPO Wandb logsby Alexander Vishnevskiy\n\n\n\n\n\n### 6. Evaluation\n\n\n\nEvaluating LLMs reliably is a challenging but essential task for refining dataset composition and training settings. It is important to acknowledge Goodhart’s law: “When a measure becomes a target, it ceases to be a good measure.”\n\n\n\n- Automated Benchmarks: Use curated datasets and metrics (such as MMLU) to assess performance on specific tasks. This approach works well for concrete tasks but may struggle with abstract capabilities and suffer from data contamination.\n\n- Human Evaluation: Involve human assessors to prompt models and rate outputs. This method ranges from informal checks to systematic annotations and large-scale community voting (arena) and tends to work best for subjective assessments.\n\n- Model-based Evaluation: Implement judge or reward models to assess generated responses. Although they often correlate well with human judgment, these models may be biased toward their own outputs.\n\n- Feedback Signal: Analyze error patterns to identify shortcomings, such as problems following complex instructions, lacking specific knowledge, or being vulnerable to adversarial prompts. Use the feedback to adjust data generation and training parameters.\n\n\n\nReferences:\n\n\n\n- Evaluation Guidebookby Clémentine Fourrier\n\n- Open LLM Leaderboardby Hugging Face\n\n- Language Model Evaluation Harnessby EleutherAI\n\n- Lightevalby Hugging Face\n\n- Chatbot Arenaby LMSYS\n\n\n\n\n\n### 7. Quantization\n\n\n\nQuantization converts a model’s parameters and activations from high precision (e.g., FP32) to lower precision (such as 4 bits) to reduce compute and memory requirements.\n\n\n\n- Base Techniques: Understand the different precisions (FP32, FP16, INT8, etc.) and basic quantization methods like absmax and zero-point techniques.\n\n- GGUF & llama.cpp: Originally created for CPU-based runs,llama.cppand the GGUF format are now widely used to run LLMs on consumer hardware. They support the storage of special tokens, vocabulary, and metadata all in one file.\n\n- GPTQ & AWQ: Methods such asGPTQ/EXL2andAWQuse layer-wise calibration to maintain performance at very low bitwidths. These techniques adjust scaling dynamically and can selectively bypass or re-center the heaviest parameters.\n\n- SmoothQuant & ZeroQuant: New methods such as SmoothQuant (which applies quantization-friendly transformations) and compiler-based optimizations like ZeroQuant help alleviate outlier issues before quantization, optimizing data flow and reducing hardware overhead.\n\n\n\nReferences:\n\n\n\n- Introduction to Quantizationby Maxime Labonne\n\n- Quantize Llama models with llama.cppby Maxime Labonne\n\n- 4-bit LLM Quantization with GPTQby Maxime Labonne\n\n- Understanding Activation-Aware Weight Quantizationby FriendliAI\n\n- SmoothQuant on Llama 2 7Bby MIT HAN Lab\n\n- DeepSpeed Model Compressionby DeepSpeed\n\n\n\n\n\n### 8. New Trends\n\n\n\nThis section covers emerging topics that do not neatly fit into other categories. Some ideas, like model merging and multimodal models, are well established, while others—such as interpretability or test-time compute scaling—are more experimental and actively researched.\n\n\n\n- Model Merging: Merging pre-trained models has become a popular technique for boosting performance without additional fine-tuning. Themergekitlibrary implements several popular merging methods, including SLERP,DARE, andTIES.\n\n- Multimodal Models: Models likeCLIP,Stable Diffusion, andLLaVAare designed to process and integrate various types of inputs (text, images, audio, etc.) within a unified embedding space, enabling powerful applications such as text-to-image generation.\n\n- Interpretability: Mechanistic interpretability approaches, including Sparse Autoencoders (SAEs) and techniques like abliteration, offer insights into the internal operations of LLMs and can allow for behavioral adjustments without retraining.\n\n- Test-time Compute: Scaling computational resources during inference often requires multiple calls and specialized models (e.g., Process Reward Model (PRM)). Iterative procedures with fine-tuned scoring can markedly enhance performance on complex reasoning tasks.\n\n\n\nReferences:\n\n\n\n- Merge LLMs with mergekitby Maxime Labonne\n\n- Smol Visionby Merve Noyan\n\n- Large Multimodal Modelsby Chip Huyen\n\n- Uncensor any LLM with abliterationby Maxime Labonne\n\n- Intuitive Explanation of SAEsby Adam Karvonen\n\n- Scaling test-time computeby Beeching et al.\n\n\n\n\n\n### The LLM Engineer\n\n\n\nThis part of the course teaches you how to build production-grade applications powered by LLMs, with a focus on augmenting models and deploying them.\n\n\n\n### 1. Running LLMs\n\n\n\nRunning LLMs can be challenging given their high hardware requirements. Depending on your needs, you might opt to use an API (like GPT-4) or run a model locally. In either case, careful prompting and guidance can greatly enhance output quality and relevance.\n\n\n\n- LLM APIs: APIs provide a convenient way to access LLMs. They are divided between private LLMs (e.g.,OpenAI,Google,Anthropic,Cohere) and open-source LLMs (e.g.,OpenRouter,Hugging Face,Together AI).\n\n- Open-source LLMs: TheHugging Face Hubis a prime resource for finding LLMs. You can run many of these models inHugging Face Spaces, or download and operate them locally using tools likeLM Studio,llama.cpp, orOllama.\n\n- Prompt Engineering: Techniques such as zero-shot prompting, few-shot prompting, chain-of-thought, and ReAct are common. While these methods work better with larger models, they can be adapted for smaller ones.\n\n- Structuring Outputs: Some tasks require outputs to follow a strict format (such as a JSON format or specific template). Tools such asLMQL,Outlines, andGuidancehelp ensure the generated text adheres to the required structure.\n\n\n\nReferences:\n\n\n\n- Run an LLM locally with LM Studioby Nisha Arya\n\n- Prompt engineering guideby DAIR.AI\n\n- Outlines – Quickstart\n\n- LMQL – Overview\n\n\n\n\n\n### 2. Building a Vector Storage\n\n\n\nThe first step in creating a Retrieval Augmented Generation (RAG) pipeline is establishing a vector storage. This involves loading documents, splitting them into manageable pieces, and then converting key text chunks into vector embeddings for future retrieval.\n\n\n\n- Ingesting Documents: Document loaders can process multiple formats such as PDF, JSON, HTML, and Markdown. They can also pull in data directly from databases and APIs (e.g., GitHub, Reddit, Google Drive).\n\n- Splitting Documents: Text splitters divide documents into smaller, semantically relevant chunks. Instead of a fixed character count, splitting by headers or recursively—while preserving metadata—often yields better results.\n\n- Embedding Models: These models transform text into vector representations, enabling a more nuanced semantic interpretation that is essential for effective search.\n\n- Vector Databases: Databases likeChroma,Pinecone,Milvus,FAISS, andAnnoyare designed for storing embeddings, allowing for fast similarity-based retrieval.\n\n\n\nReferences:\n\n\n\n- LangChain – Text splitters\n\n- Sentence Transformers library\n\n- MTEB Leaderboard\n\n- The Top 5 Vector Databasesby Moez Ali\n\n\n\n\n\n### 3. Retrieval Augmented Generation\n\n\n\nRetrieval Augmented Generation (RAG) enhances LLM outputs by using relevant contextual documents fetched from a vector database, thus improving answer accuracy without needing additional fine-tuning.\n\n\n\n- Orchestrators: Tools likeLangChain,LlamaIndex, andFastRAGconnect LLMs to tools, databases, and memory systems, extending their functionality.\n\n- Retrievers: Since user queries may not be optimized for search, techniques such as multi-query retrievers orHyDEcan reformulate queries to improve retrieval performance.\n\n- Memory: To maintain context over a conversation, LLMs use a history buffer that can be enhanced with summarization techniques or integrated with vector stores via RAG.\n\n- Evaluation: It is crucial to assess both the document retrieval process (precision and recall) and the generation stage (faithfulness and relevancy). Tools likeRagasandDeepEvalcan assist in these evaluations.\n\n\n\nReferences:\n\n\n\n- Llamaindex – High-level concepts\n\n- Pinecone – Retrieval Augmentation\n\n- LangChain – Q&A with RAG\n\n- LangChain – Memory types\n\n- RAG pipeline – Metrics\n\n\n\n\n\n### 4. Advanced RAG\n\n\n\nIn real-world scenarios, you may need to develop more complex pipelines involving SQL or graph databases, as well as systems that automatically select appropriate tools and APIs to enhance the baseline RAG setup.\n\n\n\n- Query Construction: For structured data stored in databases, you need to translate user instructions into appropriate query languages like SQL or Cypher.\n\n- Agents and Tools: LLM agents can automatically choose the most suitable tools—ranging from simple web searches (e.g., Google, Wikipedia) to complex systems (e.g., Python interpreters, Jira)—to answer queries.\n\n- Post-Processing: Enhance the overall relevance of retrieved documents using re-ranking methods,RAG-fusion, or classification techniques.\n\n- Program LLMs: Frameworks likeDSPyallow you to fine-tune prompts and model parameters programmatically based on automated evaluations.\n\n\n\nReferences:\n\n\n\n- LangChain – Query Construction\n\n- LangChain – SQL\n\n- Pinecone – LLM agents\n\n- LLM Powered Autonomous Agentsby Lilian Weng\n\n- LangChain – OpenAI’s RAG\n\n- DSPy in 8 Steps\n\n\n\n\n\n### 5. Inference Optimization\n\n\n\nSince generating text is computationally intensive, several techniques exist to maximize throughput and reduce inference costs alongside quantization.\n\n\n\n- Flash Attention: Optimizes the attention mechanism by reducing its complexity from quadratic to linear, thereby speeding up both training and inference.\n\n- Key-value Cache: Learn about the key-value cache and enhancements likeMulti-Query Attention(MQA) andGrouped-Query Attention(GQA).\n\n- Speculative Decoding: Use a smaller model to produce draft outputs that are later refined by a larger model, thus accelerating text generation.\n\n\n\nReferences:\n\n\n\n- GPU Inferenceby Hugging Face\n\n- LLM Inferenceby Databricks\n\n- Optimizing LLMs for Speed and Memoryby Hugging Face\n\n- Assisted Generationby Hugging Face\n\n\n\n\n\n### 6. Deploying LLMs\n\n\n\nDeploying LLMs, especially at scale, is complex and may require multiple GPU clusters. However, demos or local applications often have simpler requirements.\n\n\n\n- Local Deployment: Open-source LLMs offer privacy advantages over private models. Solutions such asLM Studio,Ollama,oobabooga, andkobold.cppfacilitate local deployment.\n\n- Demo Deployment: Tools likeGradioandStreamlitare excellent for prototyping apps and sharing demos. They are also easy to host online (for example, onHugging Face Spaces).\n\n- Server Deployment: Running LLMs at scale often demands cloud infrastructure (or on-prem solutions) and specialized frameworks such asTGIorvLLM.\n\n- Edge Deployment: In resource-constrained environments, frameworks likeMLC LLMandmnn-llmenable deployment on web browsers, Android, and iOS.\n\n\n\nReferences:\n\n\n\n- Streamlit – Build a basic LLM appby Streamlit\n\n- HF LLM Inference Containerby Hugging Face\n\n- Philschmid blogby Philipp Schmid\n\n- Optimizing Latencyby Hamel Husain\n\n\n\n\n\n### 7. Securing LLMs\n\n\n\nLLM applications bring their own unique security challenges in addition to standard software vulnerabilities.\n\n\n\n- Prompt Hacking: This includes issues like prompt injection (where unwanted instructions hijack the model), data/prompt leaking (extracting the original prompt or training data), and jailbreaking (bypassing the model’s safety features).\n\n- Backdoors: These attacks can target training data by poisoning it with false or malicious content, or by introducing hidden triggers that alter model behavior during inference.\n\n- Defensive Measures: Protect your LLM applications by testing them for vulnerabilities using techniques such as red teaming and tools likegarak, while monitoring in production with frameworks likelangfuse.\n\n\n\nReferences:\n\n\n\n- OWASP LLM Top 10by HEGO Wiki\n\n- Prompt Injection Primerby Joseph Thacker\n\n- LLM Securityby@llm_sec\n\n- Red teaming LLMsby Microsoft\n\n\n\n",
  "metadata": {
    "url": "https://originshq.com/blog/top-ai-llm-learning-resource-in-2025/#ib-toc-anchor-0",
    "crawled_at": "2025-02-28T11:03:06.117748"
  },
  "summary": "The blog is structured into three main segments:\n\n1. **LLM Fundamentals (optional)**: Covers essential topics such as mathematics, Python, and neural networks.\n   - **Mathematics for Machine Learning**: Includes linear algebra, calculus, and probability/statistics.\n   - **Python for Machine Learning**: Covers Python basics, data science libraries, data preprocessing, and machine learning libraries.\n   - **Neural Networks**: Fundamentals, training/optimization, overfitting, and implementing multilayer perceptrons.\n   - **Natural Language Processing (NLP)**: Text preprocessing, feature extraction, word embeddings, and recurrent neural networks.\n\n2. **The LLM Scientist**: Focuses on building high-performing LLMs using state-of-the-art techniques.\n   - **LLM Architecture**: Tokenization, attention mechanisms, and sampling techniques.\n   - **Pre-training Models**: Data preparation, distributed training, and training optimization.\n   - **Post-training Datasets**: Storage, synthetic data generation, data enhancement, and quality filtering.\n   - **Supervised Fine-Tuning**: Training techniques, parameters, and distributed training.\n   - **Preference Alignment**: Rejection sampling, direct preference optimization, and proximal policy optimization.\n   - **Evaluation**: Automated benchmarks, human evaluation, model-based evaluation, and feedback signals.\n   - **Quantization**: Base techniques, GGUF & llama.cpp, GPTQ & AWQ, SmoothQuant & ZeroQuant.\n   - **New Trends**: Model merging, multimodal models, interpretability, and test-time compute scaling.\n\n3. **The LLM Engineer**: Teaches how to build production-grade applications powered by LLMs.\n   - **Running LLMs**: LLM APIs, open-source LLMs, prompt engineering, and structuring outputs.\n   - **Building a Vector Storage**: Ingesting documents, splitting documents, embedding models, and vector databases.\n   - **Retrieval Augmented Generation (RAG)**: Orchestrators, retrievers, memory, and evaluation.\n   - **Advanced RAG**: Query construction, agents and tools, post-processing, and program LLMs.\n   - **Inference Optimization**: Flash attention, key-value cache, and speculative decoding.\n   - **Deploying LLMs**: Local deployment, demo deployment, server deployment, and edge deployment.\n   - **Securing LLMs**: Prompt hacking, backdoors, and defensive measures.\n\nEach section includes references to relevant resources and tools for further learning and implementation."
}